# SketchCannotBeAutomaticallyDimensioned Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..SketchCannotBeAutomaticallyDimensioned Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Sketch can't be Automatically Dimensioned - this is a prerequisite for Labeled Dimensions to work properly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchCannotBeAutomaticallyDimensioned { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchCannotBeAutomaticallyDimensioned As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchCannotBeAutomaticallyDimensioned {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace